Tekla Open API Reference for Tekla Structures 2025
AnalysisDesignParameterMulti Constructor (String, Int32, Identifier)
 Initializes a new instance of the AnalysisDesignParameterMulti class.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public AnalysisDesignParameterMulti(
	string analysisModelName,
	int parameterId,
	Identifier partId
)
Public Sub New (
	analysisModelName As String,
	parameterId As Integer,
	partId As Identifier
)
Parameters
analysisModelName
Type: System.String
 The analysis model name.
parameterId
Type: System.Int32
 The analysis design parameter ID.
partId
Type: Tekla.Structures.Identifier
 The father part ID.
See Also
Reference
AnalysisDesignParameterMulti Class
AnalysisDesignParameterMulti Overload
Tekla.Structures.Analysis Namespace